In [2]:
from pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder.appName("codingChallenge").getOrCreate()

In [19]:
df = spark.read.csv("Departments.csv", header=True, inferSchema=True)
df.show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
| Chandu|Data Science| 10000|
| Chandu|         IOT|  5000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
| Rohith|Data Science|  3000|
|Krishna|Data Science| 20000|
|Krishna|         IOT| 10000|
|Krishna|    Big Data|  5000|
| Rashmi|Data Science| 10000|
| Rashmi|    Big Data|  2000|
+-------+------------+------+

In [4]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)

In [7]:
# GROUP BY IN PYSPARK

In [5]:
df.groupBy("Department").sum("Salary").show()

+------------+-----------+
|  Department|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [6]:
df.groupBy("Department").avg("Salary").show()

+------------+-----------+
|  Department|avg(Salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [8]:
df.groupBy("Name").max('Salary').show()

+-------+-----------+
|   Name|max(Salary)|
+-------+-----------+
| Rashmi|      10000|
| Chandu|      10000|
|Krishna|      20000|
| Rohith|       4000|
+-------+-----------+

In [9]:
# SORT IN PYSPARK

In [10]:
df.sort("Name").show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
| Chandu|Data Science| 10000|
| Chandu|         IOT|  5000|
| Chandu|    Big Data|  4000|
|Krishna|Data Science| 20000|
|Krishna|         IOT| 10000|
|Krishna|    Big Data|  5000|
| Rashmi|Data Science| 10000|
| Rashmi|    Big Data|  2000|
| Rohith|    Big Data|  4000|
| Rohith|Data Science|  3000|
+-------+------------+------+

In [11]:
df.sort("Department", "Salary").show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
| Rashmi|    Big Data|  2000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
|Krishna|    Big Data|  5000|
| Rohith|Data Science|  3000|
| Chandu|Data Science| 10000|
| Rashmi|Data Science| 10000|
|Krishna|Data Science| 20000|
| Chandu|         IOT|  5000|
|Krishna|         IOT| 10000|
+-------+------------+------+

In [13]:
df.sort(df["Salary"].desc()).show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
|Krishna|Data Science| 20000|
| Chandu|Data Science| 10000|
|Krishna|         IOT| 10000|
| Rashmi|Data Science| 10000|
| Chandu|         IOT|  5000|
|Krishna|    Big Data|  5000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
| Rohith|Data Science|  3000|
| Rashmi|    Big Data|  2000|
+-------+------------+------+

In [14]:
# SIMILAR TO SORT WE HAVE ORDER BY IN PYSPARK

In [15]:
df.orderBy("Salary").show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
| Rashmi|    Big Data|  2000|
| Rohith|Data Science|  3000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
| Chandu|         IOT|  5000|
|Krishna|    Big Data|  5000|
| Chandu|Data Science| 10000|
|Krishna|         IOT| 10000|
| Rashmi|Data Science| 10000|
|Krishna|Data Science| 20000|
+-------+------------+------+

In [16]:
df.orderBy(["Name", "Salary"]).show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
| Chandu|    Big Data|  4000|
| Chandu|         IOT|  5000|
| Chandu|Data Science| 10000|
|Krishna|    Big Data|  5000|
|Krishna|         IOT| 10000|
|Krishna|Data Science| 20000|
| Rashmi|    Big Data|  2000|
| Rashmi|Data Science| 10000|
| Rohith|Data Science|  3000|
| Rohith|    Big Data|  4000|
+-------+------------+------+

In [20]:
# AGGREGATIONS IN PYSPARK

In [23]:
df.groupBy('Department').avg('Salary').show()

+------------+-----------+
|  Department|avg(Salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [24]:
df.groupBy('Department').max('Salary').show()

+------------+-----------+
|  Department|max(Salary)|
+------------+-----------+
|         IOT|      10000|
|    Big Data|       5000|
|Data Science|      20000|
+------------+-----------+

In [25]:
df.groupBy('Department').min('Salary').show()

+------------+-----------+
|  Department|min(Salary)|
+------------+-----------+
|         IOT|       5000|
|    Big Data|       2000|
|Data Science|       3000|
+------------+-----------+

In [26]:
df.groupBy('Department').mean('Salary').show()

+------------+-----------+
|  Department|avg(Salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [27]:
df.groupBy('Department').sum('Salary').show()

+------------+-----------+
|  Department|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [17]:
# DROPPING MISSING VALUES

In [19]:
drop_df = spark.read.csv("Missing.csv", header=True, inferSchema=True)
drop_df.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [20]:
drop_df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [21]:
drop_df.na.drop().show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [22]:
drop_df.na.drop(how="all", thresh=2).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [23]:
drop_df.na.drop(how="any", subset=["Salary"]).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [24]:
# HANDLING THE MISSING VALUES

In [25]:
drop_df.na.fill("Missing-values").show()

+--------------+----+----------+------+
|          Name| Age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Sudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|          Paul|  24|         3| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|NULL|      NULL| 40000|
|Missing-values|  34|        10| 38000|
|Missing-values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [28]:
drop_df.na.fill(0).show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh|  0|         0| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|         0|     0|
+---------+---+----------+------+

In [29]:
# JOINS IN PYSPARK

In [4]:
df_emp = spark.read.csv("employee.csv", header=True, inferSchema=True)
df_dpt = spark.read.csv("dept.csv", header=True, inferSchema=True)

In [5]:
df_emp.show()
df_dpt.show()

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     5|   Brown|              2|       2010|         40|  NULL|    -1|
|     6|   Brown|              2|       2010|         50|  NULL|    -1|
+------+--------+---------------+-----------+-----------+------+------+

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
|Marketing|     20|
|    Sales|     30|
|       IT|     40|
+---------+-------+

In [6]:
df_emp.printSchema()
df_dpt.printSchema()

root
 |-- emp_id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- superior_emp_id: integer (nullable = true)
 |-- year_joined: integer (nullable = true)
 |-- emp_dept_id: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: integer (nullable = true)

In [7]:
# INNER JOIN

In [8]:
df_emp.join(df_dpt, df_emp.emp_dept_id == df_dpt.dept_id, "inner").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     5|   Brown|              2|       2010|         40|  NULL|    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [9]:
# OUTER JOIN

In [10]:
df_emp.join(df_dpt, df_emp.emp_dept_id == df_dpt.dept_id, "outer").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|  NULL|    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|  NULL|    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [11]:
# LEFT JOIN

In [12]:
df_emp.join(df_dpt, df_emp.emp_dept_id == df_dpt.dept_id, "left").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     5|   Brown|              2|       2010|         40|  NULL|    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|  NULL|    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [13]:
# RIGHT JOIN

In [14]:
df_emp.join(df_dpt, df_emp.emp_dept_id == df_dpt.dept_id, "right").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|  NULL|    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [15]:
# LEFT SEMI

In [16]:
df_emp.join(df_dpt, df_emp.emp_dept_id == df_dpt.dept_id, "leftsemi").show()

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     5|   Brown|              2|       2010|         40|  NULL|    -1|
+------+--------+---------------+-----------+-----------+------+------+

In [17]:
# LEFT ANTI

In [18]:
df_emp.join(df_dpt, df_emp.emp_dept_id == df_dpt.dept_id, "leftanti").show()

+------+-----+---------------+-----------+-----------+------+------+
|emp_id| name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+-----+---------------+-----------+-----------+------+------+
|     6|Brown|              2|       2010|         50|  NULL|    -1|
+------+-----+---------------+-----------+-----------+------+------+